
Функция ПолучитьМассивИсточников () Экспорт
	
	м = Новый Массив ();
	Для Каждого мета Из Метаданные.ВнешниеИсточникиДанных Цикл
		м.Добавить ( мета.Имя );
	КонецЦикла;
	Возврат м;
	
КонецФункции

Функция ПодключитьКВИД ( Ссылка ) Экспорт
	
	реквизиты = Запросы.ПолучитьРеквизиты ( Ссылка, "ИмяВнешнегоИсточника" );
	имяВнешнегоИсточника = реквизиты.ИмяВнешнегоИсточника;
	менеджер = ВнешниеИсточникиДанных [ имяВнешнегоИсточника ];
	состояние = менеджер.ПолучитьСостояние ();
	Если Состояние = СостояниеВнешнегоИсточникаДанных.Подключен Тогда
		Возврат Истина;
	КонецЕсли;	
	п = ПараметрыПодключения ( Ссылка );	
	соединение = менеджер.ПолучитьОбщиеПараметрыСоединения ();
	соединение.АутентификацияСтандартная = Не п.АутентификацияОС;
	соединение.АутентификацияОС = п.АутентификацияОС;
	соединение.ИмяПользователя = п.Логин;
	соединение.Пароль = п.Пароль;
	соединение.СтрокаСоединения = п.СтрокаПодключения;
	соединение.СУБД = СокрЛП (п.ТипСУБД );
	ответ = Ложь;
	Попытка
		менеджер.УстановитьОбщиеПараметрыСоединения ( соединение);
		менеджер.УстановитьПараметрыСоединенияПользователя ( ИмяПользователя (), соединение );
		менеджер.УстановитьПараметрыСоединенияСеанса ( соединение );
		менеджер.УстановитьСоединение();
		ответ = Истина;
	Исключение
		ответ = Ложь;
	КонецПопытки;	
	Возврат ответ;
	
КонецФункции

Функция ПараметрыПодключения ( Ссылка )  Экспорт
	
	с = "
	|выбрать
	|	Сервер как Сервер,
	|	Логин как Логин,
	|	Пароль как Пароль,
	|	ИмяВнешнейБД как ИмяВнешнейБД,
	|	АутентификацияОС как АутентификацияОС,
	|	ТипСУБД как ТипСУБД,
	|	СтрокаПодключения как СтрокаПодключения
	|из Справочник.ПодключенияВИД
	|где Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ();
	запрос.Текст = с;
	запрос.УстановитьПараметр ( "Ссылка", Ссылка );
	результат = Запрос.Выполнить ();
	Если результат.Пустой () Тогда
		Возврат Неопределено;
	Иначе
		выборка = Результат.Выбрать();
		выборка.Следующий ();
		п = Новый Структура ();
		Для Каждого колонка Из результат.Колонки Цикл
			п.Вставить ( колонка.Имя, выборка [ колонка.Имя ] );			
		КонецЦикла;
		Возврат п;
	КонецЕсли;
	
КонецФункции