
Функция ТекстПоИД ( ИД, Парамы = Неопределено ) Экспорт 
	
	Если ( ИД = "ПользовательИБНеОпределен" ) Тогда
		с = НСтр ( " ru = 'Пользователь не определен!'; en = 'User no defined!'" );		
	ИначеЕсли ( ИД = "ТаблицаНомерСтроки" ) Тогда	
		с = НСтр ( " ru = 'таблица %Table [%Row]'; en = 'table %Table [%Row]'" );
	ИначеЕсли ( ИД = "ЗаголовокФормы" ) Тогда
		с = НСтр ( " ru = 'BIM to BOQ in PDM'; en = 'BIM to BOQ in PDM'" );
	ИначеЕсли ( ИД = "ФормаПраваДоступа" ) Тогда
		с = НСтр ( " ru = 'Права доступа - %Пользователь.'; en = 'Access rights - %Пользователь.'" );
	ИначеЕсли ( ИД = "ГруппаДоступаНеВыбрана" ) Тогда
		с = НСтр ( " ru = 'Группа доступа не выбрана.'; en = 'Access group not selected.'" );
	ИначеЕсли ( ИД = "НельзяИзменитьГруппуДоступа" ) Тогда	
		с = НСтр ( " ru = 'Невозможно изменить группу доступа,
						  |так как текущий пользователь
						  |не администратор участников группы доступа и
						  |не полноправный администратор.';
						  |en = 'Unable to change access group,
						  |because the current user
						  |not an administrator of access group members and
						  |not a full administrator.'" );
	ИначеЕсли ( ИД = "ПользовательНеВыбранВТаблице" ) Тогда
		с = НСтр ( "ru = 'Пользователь не выбран. Номер строки - %НомерСтроки.'; en = 'User not selected. Line number - %НомерСтроки!'");
	ИначеЕсли ( ИД = "ПользовательПовторяетсяВСтроке" ) Тогда
		с = НСтр ( "ru = 'Пользователь в строке %НомерСтроки повторяется.'; en = 'User in line %НомерСтроки repeats.'");
	ИначеЕсли ( ИД = "ГруппаПользователейПовторяетсяВСтроке" ) Тогда
		с = НСтр ( "ru = 'Группа пользователей в строке %НомерСтроки повторяется.'; en = 'The user group in the line %НомерСтроки is repeated.'");
	ИначеЕсли ( ИД = "ГруппаПользователейНедопустимаВСтроке" ) Тогда
		с = НСтр ( "ru = 'Группа пользователей в строке %НомерСтроки недопустима в предопределенной группе доступа Администраторы.'; en = 'The user group in the line %НомерСтроки is invalid in the predefined access group Administrators'");
	ИначеЕсли ( ИД = "ВГруппеДоступаНетПользователяСДоступомКБазе" ) Тогда
		с = НСтр ( " ru = 'В группе доступа Администраторы
				          |должен быть хотя бы один пользователь,
				          |которому разрешен доступ к информационной базе.';
						  |en = 'In the Administrators access group
						  |must be at least one user,
						  |who is allowed access to the infobase.'" );	
	ИначеЕсли ( ИД = "ОшибкаВБД" ) Тогда
		с = НСтр ( " ru = 'Ошибка в базе данных: '; en = 'Error in database:'" ); 
	ИначеЕсли ( ИД = "НеНайден" ) Тогда
		с = НСтр ( " ru = ' не найден '; en = ' not found '" );
	ИначеЕсли ( ИД = "ПользователюСоответствуетБолееОдногоПользователя" ) Тогда
		с = НСтр ( " ru = 'Пользователю ИБ %Имя с идентификатором %Идентификатор
						  |соответствует более одного пользователя базы данных:';
						  |en = 'IB user %Имя with identifier %Identifier
						  |match more than one database user:'" );		
	ИначеЕсли ( ИД = "ПользователюСоответствуетПользователь" ) Тогда	
		с = НСтр ( " ru = '
						  |	%Имя с идентификатором ссылки %Идентификатор';
						  |en = '
						  |	%Имя with identificator ref '" );
	ИначеЕсли ( ИД = "УстановитьПрофильАдминистратор" ) Тогда
		с = НСтр ( " ru = 'У группы доступа Администраторы должен быть профиль Администратор.
						  |Установить профиль в группе доступа (нет - открыть только для просмотра)?';
						  |en = ''" );
	ИначеЕсли ( ИД = "ИзменилсяСоставВидовДоступаПриЧтении" ) Тогда
		с = НСтр ( " ru = 'Изменился состав видов доступа профиля этой группы доступа.
						  |Обновить виды доступа в группе доступа (нет - открыть только для просмотра)?';
						  |en = ''" );	
	ИначеЕсли ( ИД = "ЗначениеВСтрокеНеВыбрано" ) Тогда	
		с = НСтр ( " ru = 'Значение в строке %НомерСтроки не выбрано.'; en = 'No value on line number %НомерСтроки has been selected.'" );	
	ИначеЕсли ( ИД = "ЗначениеВСтрокеПовторяется" ) Тогда	
		с = НСтр ( " ru = 'Значение в строке %НомерСтроки повторяется.'; en = 'The value in the line %НомерСтроки is repeated.'" );	
	ИначеЕсли ( ИД = "НеизвестныйТип" ) Тогда	
		с = НСтр ( " ru = 'Неизвестный тип ""%Тип"".'; en = 'Unknown type ""%Тип"".'" );
	ИначеЕсли ( ИД = "ТекстСовпадает" ) Тогда
		с = НСтр ( " ru = 'Неизвестный тип ""%Тип"".'; en = 'Unknown type ""%Тип"".'" );	
	ИначеЕсли ( ИД = "ТекстНеСовпадает" ) Тогда
		с = НСтр ( " ru = '(не совпадает)'; en = '(not equal)'" );
	ИначеЕсли ( ИД = "НеСовпадаетПарольИПодтверждение" ) Тогда
		с = НСтр ( " ru = 'Пароль и подтверждение пароля не совпадают!'; en = 'Password and password confirmation do not match!'" );	
	ИначеЕсли ( ИД = "НеУказанПароль" ) Тогда
		с = НСтр ( " ru = 'Пароль не указан. 
						  |Записать пользователя без пароля?.';
						  |en = 'Password not filled.
						  |Register user without password??'" );
	ИначеЕсли ( ИД = "ИсключитьПользователяИзГруппыДоступа" ) Тогда
		с = НСтр ( " ru = 'Исключить пользователя - %Пользователь из выделенных групп доступа?'; en = 'Exclude user - %Пользователь from selected access groups?'" );	
	ИначеЕсли ( ИД = "ПерезапуститьСейчас" ) Тогда	
		с = НСтр ( " ru = 'Перезапустить сейчас?'; en = 'Restart now'" );	
	ИначеЕсли ( ИД = "ПарольИзменен" ) Тогда	
		с = НСтр ( " ru = 'Пароль изменен!'; en = 'Password changed!'" );	
	ИначеЕсли ( ИД = "ВыберитеФайлДляЗагрузки" ) Тогда	
		с = НСтр ( " ru = 'Выберите файл:'; en = 'Select file:'" );
	ИначеЕсли ( ИД = "ФайлСохранен" ) Тогда	
		с = НСтр ( " ru = 'ФАЙЛ СОХРАНЕН.'; en = 'FILE SAVE.'" );
	ИначеЕсли ( ИД = "СохранениеФайла" ) Тогда	
		с = НСтр ( " ru = ' сохранение файла ...'; en = ' saving a file...'" );
	ИначеЕсли ( ИД = "ОбработкаEPF" ) Тогда	
		с = НСтр ( " ru = 'Обработка (*.epf)|*.epf'; en = 'Dataprocessor (*.epf)|*.epf'" );	
	ИначеЕсли ( ИД = "ОтчетERF" ) Тогда	
		с = НСтр ( " ru = 'Отчет (*.erf)|*.erf'; en = 'Report (*.erf)|*.erf'" );	
	ИначеЕсли ( ИД = "НедостаточноПравДляРаботыВПериоде" ) Тогда	
		с = НСтр ( " ru = 'Недостаточно прав для работы с данныем документом в этом периоде! Обратитесь к администратору для настройки прав доступа!';
					|en = 'Insufficient rights to work with this document in this period! Contact your administrator to set up access rights!'" );	
	ИначеЕсли ( ИД = "ФильтрВсеПоТипам" ) Тогда	
		с = НСтр ( "ru = 'Все файлы '; en = 'All types '; ua = 'Усі файли '" ) + "(*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif;*.pdf;*.xml;*.txt;*.doc;*.docx;*.xls;*.xlsx;*.rvt;*.svf;*.rar;*.zip)|*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif;*.pdf;*.xml;*.txt;*.doc;*.docx;*.xls;*.xlsx;*.rvt;*.svf;*.rar;*.zip|"
			+ НСтр ( "ru = 'PDF '; en = 'PDF '; ua = 'PDF '" ) + "(*.pdf)|*.pdf|"
			+ НСтр ( "ru = 'Word '; en = 'Word '; ua = 'Word '" ) + "(*.doc;*.docx)|*.doc;*.docx|"
			+ НСтр ( "ru = 'Excel '; en = 'Excel '; ua = 'Excel '" ) + "(*.xls;*.xlsx)|*.xls;*xlsx|"
			+ НСтр ( "ru = 'Текст '; en = 'Text '; ua = 'Текст '" ) + "(*.txt)|*.txt|"
			+ НСтр ( "ru = 'XML '; en = 'XML '; ua = 'XML '" ) + "(*.xml)|*.xml|"
			+ НСтр ( "ru = 'Архивы '; en = 'Archives '; ua = 'Архіви '" ) + "(*.rar;*.zip)|*.rar;*.zip|"
			+ НСтр ( "ru = 'Изображения '; en = 'Images '; ua = 'Зображення '" ) + "(*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif)|*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif|"
			+ НСтр ( "ru = 'RVT '; en = 'RVT '; ua = 'RVT '" ) + "(*.rvt)|*.rvt|"
			+ НСтр ( "ru = 'SVF '; en = 'SVF '; ua = 'SVF '" ) + "(*.svf)|*.svf|";
	ИначеЕсли ( ИД = "ФильтрPDF" ) Тогда	
		с = НСтр ( "ru = 'PDF '; en = 'PDF '; ua = 'PDF '" ) + "(*.pdf)|*.pdf|";
	ИначеЕсли ( ИД = "ФильтрАрхив" ) Тогда	
		с = НСтр ( "ru = 'Архивы '; en = 'Archives '; ua = 'Архіви '" ) + "(*.rar;*.zip)|*.rar;*.zip|";
	ИначеЕсли ( ИД = "ФильтрRVT" ) Тогда	
		с = НСтр ( "ru = 'RVT '; en = 'RVT '; ua = 'RVT '" ) + "(*.rvt)|*.rvt|";
	ИначеЕсли ( ИД = "ФильтрSVF" ) Тогда	
		с = НСтр ( "ru = 'SVF '; en = 'SVF '; ua = 'SVF '" ) + "(*.svf)|*.svf|";
	ИначеЕсли ( ИД = "ФильтрDOC" ) Тогда	
		c = НСтр ( "ru = 'Word '; en = 'Word '; ua = 'Word '" ) + "(*.doc;*.docx)|*.doc;*docx|";
	ИначеЕсли ( ИД = "ФильтрExcel" ) Тогда	
		c = НСтр ( "ru = 'Excel '; en = 'Excel '; ua = 'Excel '" ) + "(*.xls;*.xlsx)|*.xls;*xlsx|";
	ИначеЕсли ( ИД = "ФильтрText" ) Тогда	
		c = НСтр ( "ru = 'Текст '; en = 'Text '; ua = 'Текст '" ) + "(*.txt)|*.txt|";
	ИначеЕсли ( ИД = "ФильтрXML" ) Тогда	
		c = НСтр ( "ru = 'XML '; en = 'XML '; ua = 'XML '" ) + "(*.xml)|*.xml|";
	ИначеЕсли ( ИД = "ФильтрImages" ) Тогда	
		c = НСтр ( "ru = 'Изображения '; en = 'Images '; ua = 'Зображення '" ) + "(*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif)|*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif|";
	ИначеЕсли ( ИД = "ФильтрВсе" ) Тогда	
		c = НСтр ( "ru = 'Все файлы '; en = 'All types '; ua = 'Усі файли '" ) + "(*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif;*.pdf;*.xml;*.txt;*.doc;*.docx;*.xls;*.xlsx;*.rvt;*.svf;*.rar;*.zip)|*.bmp;*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.tif;*.pdf;*.xml;*.txt;*.doc;*.docx;*.xls;*.xlsx;*.rvt;*.svf;*.rar;*.zip|";	
	ИначеЕсли ( ИД = "ВыбратьФайл" ) Тогда
		с = НСтр ( "ru = 'Выберите файл (ы)';en = 'Select file (s)'" );
	ИначеЕсли ( ИД = "ЗагрузкаФайла" ) Тогда	
		с = НСтр ( "ru = 'Загрузка файла %ИмяФайла.; en = 'Loading file %ИмяФайла.'" );
	ИначеЕсли ( ИД = "РазмерФайла" ) Тогда	
		с = НСтр ( "ru = 'Размер файла %Размер байт.; en = 'Size %Размер bytes.'" );
	ИначеЕсли ( ИД = "ФайлДобавлен" ) Тогда	
		с = НСтр ( "ru = 'Файл добавлен.; en = 'The file has been loaded.'" );	
	ИначеЕсли ( ИД = "ДобавлениеФайла" ) Тогда	
		с = НСтр ( "ru = ' добавление файла ...; en = ' loading file ...'" );	
	ИначеЕсли ( ИД = "ПревышениеРазмераФайла" ) Тогда	
		с = НСтр ( "ru = 'Отказ. Загружаемый файл - %ИмяФайла имеет размер более 10 мегабайта.'.; en = 'Cancel. The file to be uploaded - %ИмяФайла is over 10 megabytes in size.'" );	
	ИначеЕсли ( ИД = "ОбработкиПоРазделу" ) Тогда
		с = НСтр ( "ru = 'Обработки (подсистема - %Раздел); en = 'Data processors (subsystem - %Раздел).'" );	
	ИначеЕсли ( ИД = "ОбработкиПоОтчету" ) Тогда
		с = НСтр ( "ru = 'Отчеты (подсистема - %Раздел); en = 'Reports (subsystem - %Раздел).'" );
	ИначеЕсли ( ИД = "ОбъектНеЗаписан" ) Тогда
		с = НСтр ( "ru = 'Объект не записан!'; en = 'Object not recorded!'" );
	ИначеЕсли ( ИД = "ВопросУдалитьФайл" ) Тогда
		с = НСтр ( "ru = 'Удалить файл - %ИмяФайла?'; en = 'Delete file - %ИмяФайла?'" );
	ИначеЕсли ( ИД = "ФайлУдален" ) Тогда
		с = НСтр ( "ru = 'Файл удален!'; en = 'File deleted!'" );	
	ИначеЕсли ( ИД = "ФайлСохранен" ) Тогда
		с = НСтр ( "ru = 'Файл сохранен!'; en = 'File saved!'" );	
	ИначеЕсли ( ИД = "СохранениеФайла" ) Тогда
		с = НСтр ( "ru = ' сохранение файла ...'; en = ' saving file ...'" );		
	ИначеЕсли ( ИД = "УдалитьФайлПроектнойДокументации" ) Тогда
		с = НСтр ( "ru = 'Удалить ранее добавленный файл RVT и добавить новый файл?'; en = 'Delete previously added RVT file and add new file?'" );	
	ИначеЕсли ( ИД = "ЗапуститьОбработкуМодели" ) Тогда
		с = НСтр ( "ru = 'Запустить процесс обработки модели?'; en = 'Start model processing?'" );	
	ИначеЕсли ( ИД = "ПрерватьОбработкуМодели" ) Тогда
		с = НСтр ( "ru = 'Прервать процесс обработки модели?'; en = 'Stop model processing?'" );	
	ИначеЕсли ( ИД = "УдалитьРезультатыОбработкиМодели" ) Тогда
		с = НСтр ( "ru = 'Удалить результаты обработки модели?'; en = 'Delete model processing results?'" );	
	ИначеЕсли ( ИД = "НельзяУдалитьПредопределенноеЗадание" ) Тогда
		с = НСтр ( "ru = 'Нельзя удалить предопределенное задание: %Наименование.'; en = 'You cannot delete a predefined scheduled job: %Наименование.'" );	
	ИначеЕсли ( ИД = "ОшибкаПриСохраненииРасписания" ) Тогда
		с = НСтр ( "ru = 'Произошла ошибка при сохранении расписания выполнения обменов.
						 |Возможно данные расписания были изменены. 
						 |Закройте форму настройки и повторите попытку изменения расписания еще раз.
						 |Подробное описание ошибки: %Ошибка.';
						 |en = 'An error occurred while saving the exchange execution schedule.
						 |Perhaps the schedule data has been changed.
						 |Close the settings form and try changing the schedule again.
						 |Detailed error description: %Ошибка.'" );		
	ИначеЕсли ( ИД = "Выполнять" ) Тогда
		с = НСтр ( "ru = 'Выполнять:'; en = 'Perform:'" );	
	ИначеЕсли ( ИД = "НеВыбраныМетаданныеРегламентногоЗадания" ) Тогда
		с = НСтр ( "ru = 'Не выбраны метаданные регламентного задания.'; en = 'Scheduled job metadata not selected.'" );	
	ИначеЕсли ( ИД = "ОписаниеОшибки" ) Тогда
		с = НСтр ( "ru = 'Ошибка: %Ошибка.'; en = 'Error: %Ошибка.'" );		
	ИначеЕсли ( ИД = "ПодключениеКВИДВыполнено" ) Тогда
		с = НСтр ( "ru = 'Подключение к внешнему источнику выполнено успешно!:'; en = 'Connection to an external source is successful!'" );
	ИначеЕсли ( ИД = "ПодключениеКВИДНеВыполнено" ) Тогда
		с = НСтр ( "ru = 'Подключение к внешнему источнику не выполнено!:'; en = 'Connection to external source failed!'" );
	ИначеЕсли ( ИД = "НеЗагруженФайлRVT" ) Тогда
		с = НСтр ( "ru = 'Не загружен файл модели (RVT)!:'; en = 'Model file (RVT) not loaded!'" );
	ИначеЕсли ( ИД = "ВыгрузитьФайлRVTНаFTP" ) Тогда
		с = НСтр ( "ru = 'Выгрузить файл модели (RVT) на FTP сервер?:'; en = 'Unload model file (RVT) on FTP server?'" );
	Иначе
		с = НСтр ( "ru = 'ИД сообщения не найдено! ИД - " + ИД + "!'; en = 'Message ID not found! ID - "  + ИД + "!'" );
	КонецЕсли;
	текст = ФорматироватьСтроку ( с, Парамы );
	Возврат текст;
	
КонецФункции

Функция ФорматироватьСтроку ( Текст, Парамы ) Экспорт

	Если ( Парамы = Неопределено ) Тогда
		Возврат Текст;
	КонецЕсли;
	результат = Текст;
	м = Новый Массив ();  
	Для Каждого параметр Из Парамы Цикл
		м.Добавить ( параметр.Ключ );
	КонецЦикла;
	индекс = 0;
	Пока ( Истина ) Цикл
		счетчик = 0;
		макс = 0;
		Для Каждого параметр Из м Цикл
			длина = СтрДлина ( параметр );
			Если ( длина > макс ) Тогда
				макс = длина;
				индекс = счетчик;
			КонецЕсли;
			счетчик = счетчик + 1;
		КонецЦикла;
		к = м [ индекс ];
		м.Удалить ( индекс );
		результат = СтрЗаменить ( результат, "%" + к, Парамы [ к ] );
		Если ( м.ВГраница () = - 1 ) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат результат;

КонецФункции

Процедура СообщениеВывести ( ИД, Парамы = Неопределено, Поле = "", КлючДанных = Неопределено, ПутьКДанным = "Объект", ЖурналРегистрации = Ложь ) Экспорт

	сообщение = Новый СообщениеПользователю ();
	с = Сообщения.ТекстПоИД ( ИД, Парамы );
	#Если ( Сервер Или ВнешнееСоединение ) Тогда
		свойство = "Интерактивно";
		интерактивно = ( Парамы = Неопределено  ) Или Не Парамы.Свойство ( свойство ) Или Парамы [ свойство ];
	#Иначе
		интерактивно = Ложь;
	#КонецЕсли
	Если ( интерактивно ) Тогда
		сообщение.ПутьКДанным = ПутьКДанным;
		сообщение.Поле = Поле;
		сообщение.КлючДанных = КлючДанных;
	Else
		префикс = Новый Массив ();
		Если ( ЗначениеЗаполнено ( КлючДанных ) ) Тогда
			префикс.Добавить ( Строка ( КлючДанных ) );
			таблица = получитьИмяТаблицы ( Поле );
			Если ( таблица <> Неопределено ) Тогда
				имя = КлючДанных.Метадата ().ТабличныеЧасти [ таблица.Имя ].Представление ();
				префикс.Добавить ( Сообщения.ТекстПоИД ( "ТаблицаНомерСтроки", Новый Структура ( "Таблица, НомерСтроки", имя, таблица.НомерСтроки ) ) );
			КонецЕсли;
		КонецЕсли;
		Если ( префикс.Количество () > 0 ) Тогда
			с = СтрСоединить ( префикс, ", " ) + ": " + с;
		КонецЕсли;
	КонецЕсли;
	сообщение.Текст = с;
	сообщение.Сообщить ();

КонецПроцедуры

Функция получитьИмяТаблицы ( Поле )

	к = СтрНайти ( Поле, "[" );
	л = СтрНайти ( Поле, "]", , к );
	Если ( к = 0 Или л = 0 ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	имя = СокрЛП ( Лев ( Поле, к - 1 ) );
	номерСтроки = 1 + Число ( Сред ( Поле, к + 1, л - к - 1 ) );
	Возврат Новый Структура ( "Таблица, НомерСтроки", имя, номерСтроки );

КонецФункции

Функция ПолучитьЗаголовок ( Текст ) Экспорт
	
	Возврат ? ( Текст = "", ТекстПоИД ( "ЗаголовокФормы" ), Текст );
	
КонецФункции

&НаКлиенте
Процедура Оповещение ( ИД, Парамы = Неопределено, НавигационнаяСсылка = Неопределено, ИДПояснение = Неопределено, Картинка = Неопределено ) Экспорт

	с = ТекстПоИД ( ИД, Парамы );
	Если ( ИДПояснение = Неопределено ) Тогда
		пояснение = "";
	Иначе
		пояснение = ТекстПоИД ( ИДПояснение, Парамы );		
	КонецЕсли;
	#Если ( МобильныйКлиент ) Тогда
		Сообщение ( с + Символы.ПС+ пояснение, Парамы, "", "", "" );
	#Иначе
		ПоказатьОповещениеПользователя  ( с, НавигационнаяСсылка, пояснение, Картинка );
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеПоказать ( ИД, Парамы = Неопределено, ИмяПроцедуры = "", Модуль = Неопределено, ПараметрыВозврата = Неопределено, Таймаут = 0, ЗаголовокОкна = "" ) Экспорт

	Если ( Модуль = Неопределено ) Тогда
		обработчик = Неопределено;
	Иначе
		обработчик = Новый ОписаниеОповещения ( ИмяПроцедуры, Модуль, ПараметрыВозврата );
	КонецЕсли;
	с = ТекстПоИД ( ИД, Парамы );
	надпись = ПолучитьЗаголовок ( ЗаголовокОкна );
	Если ( обработчик = Неопределено ) Тогда 
		ПоказатьПредупреждение ( , с, Таймаут, надпись );
	Иначе
		ПоказатьПредупреждение ( обработчик, с, Таймаут, надпись );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПоказать ( ИД, Парамы = Неопределено, ИмяПроцедуры, Модуль, ПараметрыВозврата = Неопределено, Кнопки = Неопределено, Таймаут = 0, КнопкаПоУмолчанию = Неопределено, ЗаголовокОкна = "" ) Экспорт

	оповещение = Новый ОписаниеОповещения ( ИмяПроцедуры, Модуль, ПараметрыВозврата );
	с = Сообщения.ТекстПоИД ( ИД, Парамы );
	Если ( Кнопки = Неопределено ) Тогда
		Кнопки = РежимДиалогаВопрос.ДаНет;		
	КонецЕсли;
	ПоказатьВопрос ( оповещение, с, Кнопки, Таймаут, КнопкаПоУмолчанию, ПолучитьЗаголовок ( ЗаголовокОкна ) );

КонецПроцедуры

&НаСервере 
Процедура ЖурналРегистрацииВывести ( ИД, Парамы = Неопределено, Событие = "", Уровень = Неопределено, Данные = Неопределено ) Экспорт	
	
	Если ( Уровень = Неопределено ) Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	с = Сообщения.ТекстПоИД ( ИД, Парамы );
	ЗаписьЖурналаРегистрации ( Событие, Уровень, , Данные, с );
	
EndProcedure