
Функция ПолучитьДеревоКлассификатора() Экспорт
	
	КлассификаторXML = Справочники.ЕдиницыИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения").ПолучитьТекст();
	КлассификаторТаблица = ОбщийСервер.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КодЧисловой", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УсловноеОбозначениеНациональное", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УсловноеОбозначениеМеждународное", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КодСОЕИ", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ВесоваяЕдиницаИзмерения", Новый ОписаниеТипов("Булево"));
	Для Каждого запись Из КлассификаторТаблица Цикл
		Если запись.Level = "1" Тогда
			СтрокаУровень1 = Дерево.Строки.Добавить();
			НоваяСтрока = СтрокаУровень1;
		ИначеЕсли запись.Level = "2" Тогда
			СтрокаУровень2 = СтрокаУровень1.Строки.Добавить();		
			НоваяСтрока = СтрокаУровень2;
		Иначе
			НоваяСтрока = СтрокаУровень2.Строки.Добавить();		
		КонецЕсли;
		НоваяСтрока.Наименование = запись.Name;
		НоваяСтрока.КодЧисловой = запись.CodeNum;
		НоваяСтрока.УсловноеОбозначениеНациональное = запись.ShortNameN;
		НоваяСтрока.УсловноеОбозначениеМеждународное = запись.ShortNameI;
		НоваяСтрока.КодСОЕИ = запись.CodeSOEI;
	КонецЦикла;	
	Возврат Дерево;

КонецФункции