
Функция СгенерироватьHTML ( ИмяФайла ) export
	
	html = создатьHTML ( ИмяФайла );
	Возврат html;
	
КонецФункции

Функция создатьHTML ( ИмяФайла )
	
	с = "";
	расширение = РаботаСФайлами.ПолучитьРасширениеФайла ( ИмяФайла );
	Если ( расширение = "gif" or расширение = "jpg" or расширение = "jpeg" or расширение = "tiff" ) Тогда
		с = создатьДляИзображения ( ИмяФайла );
	ИначеЕсли ( расширение = "txt" ) Тогда
		с = создатьДляТекста ( ИмяФайла );
	ИначеЕсли ( расширение = "xml" ) Тогда
		с = создатьДляXML ( ИмяФайла);
	ИначеЕсли ( расширение = "pdf" ) Тогда
		с = создатьДляPDF ( ИмяФайла );
	ИначеЕсли ( расширение = "doc" or расширение = "docx" ) Тогда
		с = создатьДляMSDOC ( ИмяФайла );
	ИначеЕсли ( расширение = "xls" or расширение = "xlsx" ) Тогда
		с = создатьДляMSDOC ( ИмяФайла );
	endif;
	Возврат с;
	
КонецФункции

Функция создатьДляИзображения ( ИмяФайла )
	
	макет = получитьМакетПоИмени ( "IMAGE" );
	Возврат ( СтрЗаменить ( макет, "#DATA_FILE#", ИмяФайла ) );
	
КонецФункции

Функция создатьДляТекста ( ИмяФайла )
	
	макет = получитьМакетПоИмени ( "TXT" );
	текст = получитьТекстИзФайла ( ИмяФайла );
	Возврат ( СтрЗаменить ( макет, "#DATA_FILE#", текст ) );
	
КонецФункции

Функция создатьДляXML ( ИмяФайла )
	
	темп = ПолучитьИмяВременногоФайла ( "xml" );
	запись = Новый  ЗаписьXML ();
	запись.ОткрытьФайл ( темп );
	текст = ПолучитьТекстИзФайла ( ИмяФайла );
	запись.ЗаписатьБезОбработки ( текст );
	запись.Закрыть ();
	Возврат темп;
	
КонецФункции

Функция создатьДляPDF ( ИмяФайла )
	
	дд = Новый ДвоичныеДанные ( ИмяФайла );
	строка64 = ПолучитьBase64СтрокуИзДвоичныхДанных  ( дд );
	макет = получитьМакетПоИмени ( "PDF" );
	Возврат ( СтрЗаменить ( макет, "#DATA_FILE#", строка64 ) );	
	
КонецФункции

Функция создатьДляMSDOC ( ИмяФайла )
	
	дд = Новый ДвоичныеДанные ( ИмяФайла );
	адрес = ПоместитьВоВременноеХранилище  ( дд, Новый УникальныйИдентификатор () );
	ссылка = получитьСсылкуИБ ( адрес );
	макет = получитьМакетПоИмени ( "MSDOC" );
	ссылка = ИмяФайла;
	// временное решение для показа работоспособности
	//ссылка = "https://dogma.su/upload/iblock/38d/38d44711862f284574f1351e52dbabb5.doc";
	//ссылка = "https://kub-24.ru/wp-content/uploads/price_02.03.2020.xlsx";
	Возврат ( СтрЗаменить ( макет, "#DATA_FILE#", ссылка ) );
	
КонецФункции

Функция ПолучитьТекстИзФайла ( ИмяФайла ) Экспорт
	
	чтение = Новый ТекстовыйДокумент ();
	чтение.Прочитать ( ИмяФайла, КодировкаТекста.UTF8 );
	с = чтение.ПолучитьТекст ();
	Возврат с;

КонецФункции

Функция получитьСсылкуИБ ( Адрес )
	
	Возврат ПолучитьНавигационнуюСсылкуИнформационнойБазы  () + "/" + Адрес;

КонецФункции 

Функция получитьМакетПоИмени ( Имя )
	
	макет = Обработки.ПросмотрФайлов.ПолучитьМакет ( Имя );
	Возврат макет.ПолучитьТекст ();
	
EndFunction