
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	ОбъектОтбора = Параметры.ОбъектОтбора;
	установитьПараметр ();
	
КонецПроцедуры

&НаСервере
Процедура установитьПараметр ()
	
	Список.Параметры.УстановитьЗначениеПараметра ( "ОбъектОтбора", ОбъектОтбора );	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаявкаПриИзменении ( Элемент )
	
	установитьПараметр ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДаные ( Команда )
	
	установитьПараметр ();	
	
КонецПроцедуры