
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	начальноеЗаполнение ();

КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	ИмяФайла = "";
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФайл ( Команда )
	
	диалог = Новый ДиалогВыбораФайла ( РежимДиалогаВыбораФайла.Открытие );
	диалог.МножественныйВыбор = Ложь;
	диалог.Фильтр = Сообщения.ТекстПоИД ( "ФильтрВсеПоТипам" );
	п = Новый Структура ();
	диалог.Показать ( Новый ОписаниеОповещения ( "ВыборФайла", ЭтотОбъект, п ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла ( Файлы, Парамы ) Экспорт
	
	Если ( Файлы = Неопределено ) Тогда
		Возврат;
	КонецЕсли; 
	ИмяФайла = Файлы [ 0 ];
	HTMLСтрока = получитьHTML ( ИмяФайла );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьHTML ( ИмяФайла )
	
	Возврат Обработки.ПросмотрФайлов.СгенерироватьHTML ( ИмяФайла );

КонецФункции


