
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения (  ДанныеЗаполнения, СтандартнаяОбработка )
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.ПроектнаяДокументацияНаИзделие" ) Тогда
		заполнитьПоПроектнойДокументации ( ДанныеЗаполнения );
	КонецЕсли;

КонецПроцедуры

Процедура заполнитьПоПроектнойДокументации ( ДанныеЗаполнения )
	
	ПроектнаяДокументацияНаИзделие = ДанныеЗаполнения;
	
КонецПроцедуры