
Функция СтрокаВМассив ( Строка, Разделитель = "," ) Экспорт
	
	м = СтрРазделить ( Строка, Разделитель, Ложь );
	колво = м.ВГраница ();
	Для индекс = 0 По м.ВГраница () Цикл
		м [ индекс ] = СокрЛП ( м [ индекс ] );
	КонецЦикла;
	Возврат м;

КонецФункции

Функция ДанныеИзJSON ( Текст ) Экспорт
	
	Если ( Текст = "" ) Тогда
		данные = Неопределено;
	Иначе
		чтение = Новый ЧтениеJSON ();
		чтение.УстановитьСтроку ( Текст );
		Попытка
			данные = ПрочитатьJSON ( чтение );
		Исключение
			// ошибка
		КонецПопытки;
	КонецЕсли;
	Возврат данные;
	
КонецФункции