
Функция СтрокаВМассив ( Строка, Разделитель = "," ) Экспорт
	
	м = СтрРазделить ( Строка, Разделитель, Ложь );
	колво = м.ВГраница ();
	Для индекс = 0 По м.ВГраница () Цикл
		м [ индекс ] = СокрЛП ( м [ индекс ] );
	КонецЦикла;
	Возврат м;

КонецФункции

Функция ДанныеИзJSON ( Текст ) Экспорт
	
	данные = Неопределено;
	#if ( WebClient ) then
		ВызватьИсключение Сообщения.ТекстПоИД ( "ОперацияНеПоддерживаетсяДляВебКлиента" );	
	#else
		Если ( Текст <> "" ) Тогда
			чтение = Новый ЧтениеJSON ();
			чтение.УстановитьСтроку ( Текст );
			Попытка
				данные = ПрочитатьJSON ( чтение );
			Исключение
				// ошибка
			КонецПопытки;
		КонецЕсли;
	#endif
	Возврат данные;
	
КонецФункции