
Процедура ПередЗаписью ( Отказ )
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	обновитьСоставыГруппыПользователей ();
	
КонецПроцедуры

Процедура обновитьСоставыГруппыПользователей ()
	
	// определяем группы и записываем пользователя
	
КонецПроцедуры

Процедура ПередУдалением ( Отказ )
	
	удалитьПользователяИБ ();
	очиститьСоставыГрупп ();
	
КонецПроцедуры

Процедура удалитьПользователяИБ ()
	
	
	
КонецПроцедуры

Процедура очиститьСоставыГрупп ()	
	
КонецПроцедуры

Процедура ПриКопировании ( ОбъектКопирования )
	
	ИдентификаторПользователяИБ = Неопределено;
	ИдентификаторПользователяСервиса = Неопределено;
	
КонецПроцедуры