
Процедура ЗаписатьСтатусОбработки ( Документация, ИдентификаторМодели, Статус ) Экспорт
	
	менеджер = РегистрыСведений.ОчередиОбработкиДокументации.СоздатьМенеджерЗаписи ();
	менеджер.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	менеджер.Документация = Документация;
	менеджер.ИдентификаторМодели = ИдентификаторМодели;
	менеджер.СтатусОбработки = Статус;
	менеджер.Завершен = ( Статус = Перечисления.СтатусыОбработкиДокументации.Завершена );
	менеджер.Период = ТекущаяДата ();
	менеджер.Записать ();
	
КонецПроцедуры

Функция ПолучитьРесурсы ( Документация, Пользователь = Неопределено ) Экспорт
	
	с = "
	|выбрать 
	|	ИдентификаторМодели как ИдентификаторМодели,
	|	СтатусОбработки как СтатусОбработки,
	|	Завершен как Завершен
	|из РегистрСведений.ОчередиОбработкиДокументации.СрезПоследних (  , Пользователь = &Пользователь
	|																   и Документация = &Документация )
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Пользователь", ? ( Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь ) );
	запрос.УстановитьПараметр ( "Документация", Документация );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	п = Новый Структура ();
	п.Вставить ( "ИдентификаторМодели", "" );
	п.Вставить ( "СтатусОбработки", Неопределено );
	п.Вставить ( "Завершен", Ложь );
	Пока ( выборка.Следующий () ) Цикл
		п.ИдентификаторМодели = выборка.ИдентификаторМодели;
		п.СтатусОбработки = выборка.СтатусОбработки;
		п.Завершен = выборка.Завершен;
	КонецЦикла; 
	Возврат п;

КонецФункции