
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	УстановитьПривилегированныйРежим ( Истина );
	пользователь = ПользователиИнформационнойБазы.ТекущийПользователь ();
	ПользовательИБ = пользователь.Имя;
	ИДПользователя = пользователь.УникальныйИдентификатор; 
	УстановитьПривилегированныйРежим ( Ложь );
	
КонецПроцедуры

&НаКлиенте
Процедура ОК ( Команда )
	
	проверитьВвод ();
	
КонецПроцедуры

&НаКлиенте
Процедура проверитьВвод ()
	
	результат = проверитьПароль ();
	Если ( результат ) Тогда
		Закрыть ();
		п = Новый Структура ();
		п.Вставить ( "ИДПользователя", ИДПользователя );
		п.Вставить ( "ТекущийПользователь", Истина );
		ОткрытьФорму ( "Обработка.ИзменитьПароль.Форма.ВводПароля", п, , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс );	
	Иначе
		Пароль = "";
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция проверитьПароль ()
	
	результат = Ложь;
	УстановитьПривилегированныйРежим ( Истина );
	пользователь = ПользователиИнформационнойБазы.ТекущийПользователь ();
	хеш = пользователь.СохраняемоеЗначениеПароля;
	хешНовый = Обработки.ИзменитьПароль.ПолучитьХешПароля ( пароль );
	Если ( хешНовый = хеш ) Тогда
		результат = Истина;
	Иначе
		результат = Ложь;
		ТекущийЭлемент = Элементы.Пароль;
	КонецЕсли; 
	УстановитьПривилегированныйРежим ( Ложь );
	Возврат результат;
	
КонецФункции

&НаКлиенте
Процедура ПарольПриИзменении ( Элемент )

	проверитьВвод ();
	
КонецПроцедуры